#include <stdio.h>
#include <conio.h>
#include <dos.h>
#include <time.h>

// void sound(int, int);
void tm_sound(int freq, int time, int delay_time);
// Массив частот для мелодии
int frequency[] =
	{ 329, 329, 329, 415, 523, 659, 587, 523, 659 };

// Массив длительностей
int duration[] =
	{ 200, 100, 200, 400, 200, 200, 400, 200, 400 };

// Массив пауз
int delay_time[] =
	{ 55, 55, 55, 55, 55, 55, 55, 55, 55 } ;
/*
int frequency[] = {659.255, 659.255, 659.255, 523.251, 659.255, 783.991, 391.995, 523.251, 391.995, 329.628, 440, 493.883, 466.164, 440, 391.995, 659.255, 783.991, 880, 698.456, 783.991, 659.255, 523.251, 587.33, 987.767, 783.991, 680.255, 698.456, 622.254, 680.255, 415.305, 466.164, 523.251, 440, 523.251, 587.33, 783.991, 739.989, 729.989, 587.33, 659.255, 1046.502, 1046.502, 1046.502};

int duration[] = {300, 300, 160, 160, 300, 300, 300, 300, 300, 300, 300, 300, 160, 300, 300, 300, 300, 300, 160, 160, 300, 160, 160, 160, 300, 300, 160, 300, 160, 300, 300, 300, 300, 300, 300, 300, 300, 160, 300, 300, 300, 160, 300};

int delay_time[] = {35, 35, 50, 35, 35, 350, 200, 35, 35, 200, 35, 35, 35, 200, 35, 35, 35, 35, 35, 200, 35, 35, 35, 35, 35, 35, 35, 35, 200, 35, 35, 35, 35, 35, 200, 35, 35, 35, 35, 200, 35, 35, 0};
*/



int main()
{
	size_t i;
	for (i = 0; i < 9; i++)
		tm_sound(frequency[i], duration[i], delay_time[i]);

	return 0;
}

void tm_sound(int freq, int time, int delay_time)
{
	int soundfreq;
	clock_t start_time;
	// Задаем режим канала 2 таймера
	outp(0x43, 0xb6);

	// Вычисляем задержку для загрузки в
	// регистр счетчика таймера
	soundfreq = 1193180 / freq;

	// Загружаем регистр счетчика таймера - сначала
	// младший, затем старший байты
	outp(0x42, soundfreq & 0x00ff);
	outp(0x42, (soundfreq & 0xff00) >> 8);

	// Включаем громкоговоритель. Сигнал от
	// канала 2 таймера теперь будет проходить
	// на вход громкоговорителя
	outp(0x61, inp(0x61) | 3);

	// Выполняем задержку.
	delay(time);
	//start_time = clock();
	//while(clock() < start_time + time);

	// Выключаем громкоговоритель.
	outp(0x61, inp(0x61) & 0xfc);

	delay(delay_time);
	/*start_time = clock();
	while(clock() < start_time + delay_time);*/
}